OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/lib/src/pic16/libdev/pic18f66j94.c
__at(0x0F54) __sfr PADCFG1;
__at(0x0F54) volatile __PADCFG1bits_t PADCFG1bits;

__at(0x0F55) __sfr IOCN;
__at(0x0F55) volatile __IOCNbits_t IOCNbits;

__at(0x0F56) __sfr IOCP;
__at(0x0F56) volatile __IOCPbits_t IOCPbits;

__at(0x0F57) __sfr RTCCON2;
__at(0x0F57) volatile __RTCCON2bits_t RTCCON2bits;

__at(0x0F58) __sfr ALRMVALL;

__at(0x0F59) __sfr ALRMVALH;

__at(0x0F5A) __sfr ALRMRPT;
__at(0x0F5A) volatile __ALRMRPTbits_t ALRMRPTbits;

__at(0x0F5B) __sfr ALRMCFG;
__at(0x0F5B) volatile __ALRMCFGbits_t ALRMCFGbits;

__at(0x0F5C) __sfr RTCVALL;

__at(0x0F5D) __sfr RTCVALH;

__at(0x0F5E) __sfr RTCCAL;
__at(0x0F5E) volatile __RTCCALbits_t RTCCALbits;

__at(0x0F5F) __sfr RTCCON1;
__at(0x0F5F) volatile __RTCCON1bits_t RTCCON1bits;

__at(0x0F60) __sfr DMACON1;
__at(0x0F60) volatile __DMACON1bits_t DMACON1bits;

__at(0x0F61) __sfr PIE6;
__at(0x0F61) volatile __PIE6bits_t PIE6bits;

__at(0x0F62) __sfr WPUB;
__at(0x0F62) volatile __WPUBbits_t WPUBbits;

__at(0x0F63) __sfr ACTCON;
__at(0x0F63) volatile __ACTCONbits_t ACTCONbits;

__at(0x0F64) __sfr OSCCON4;
__at(0x0F64) volatile __OSCCON4bits_t OSCCON4bits;

__at(0x0F65) __sfr OSCCON3;
__at(0x0F65) volatile __OSCCON3bits_t OSCCON3bits;

__at(0x0F66) __sfr OSCCON2;
__at(0x0F66) volatile __OSCCON2bits_t OSCCON2bits;

__at(0x0F67) __sfr BAUDCON;
__at(0x0F67) volatile __BAUDCONbits_t BAUDCONbits;

__at(0x0F67) __sfr BAUDCON1;
__at(0x0F67) volatile __BAUDCON1bits_t BAUDCON1bits;

__at(0x0F68) __sfr SSP1MSK;
__at(0x0F68) volatile __SSP1MSKbits_t SSP1MSKbits;

__at(0x0F69) __sfr SSP1CON3;
__at(0x0F69) volatile __SSP1CON3bits_t SSP1CON3bits;

__at(0x0F6A) __sfr TXBUF;
__at(0x0F6A) volatile __TXBUFbits_t TXBUFbits;

__at(0x0F6B) __sfr DMABCH;
__at(0x0F6B) volatile __DMABCHbits_t DMABCHbits;

__at(0x0F6C) __sfr DMABCL;
__at(0x0F6C) volatile __DMABCLbits_t DMABCLbits;

__at(0x0F6D) __sfr RXADDRH;
__at(0x0F6D) volatile __RXADDRHbits_t RXADDRHbits;

__at(0x0F6E) __sfr RXADDRL;
__at(0x0F6E) volatile __RXADDRLbits_t RXADDRLbits;

__at(0x0F6F) __sfr TXADDRH;
__at(0x0F6F) volatile __TXADDRHbits_t TXADDRHbits;

__at(0x0F70) __sfr TXADDRL;
__at(0x0F70) volatile __TXADDRLbits_t TXADDRLbits;

__at(0x0F71) __sfr PORTVP;
__at(0x0F71) volatile __PORTVPbits_t PORTVPbits;

__at(0x0F72) __sfr LATVP;
__at(0x0F72) volatile __LATVPbits_t LATVPbits;

__at(0x0F73) __sfr TRISVP;
__at(0x0F73) volatile __TRISVPbits_t TRISVPbits;

__at(0x0F74) __sfr UADDR;
__at(0x0F74) volatile __UADDRbits_t UADDRbits;

__at(0x0F75) __sfr UCON;
__at(0x0F75) volatile __UCONbits_t UCONbits;

__at(0x0F76) __sfr USTAT;
__at(0x0F76) volatile __USTATbits_t USTATbits;

__at(0x0F77) __sfr UEIR;
__at(0x0F77) volatile __UEIRbits_t UEIRbits;

__at(0x0F78) __sfr UIR;
__at(0x0F78) volatile __UIRbits_t UIRbits;

__at(0x0F79) __sfr UFRM;

__at(0x0F79) __sfr UFRMH;
__at(0x0F79) volatile __UFRMHbits_t UFRMHbits;

__at(0x0F7A) __sfr UFRML;
__at(0x0F7A) volatile __UFRMLbits_t UFRMLbits;

__at(0x0F7B) __sfr RCON4;
__at(0x0F7B) volatile __RCON4bits_t RCON4bits;

__at(0x0F7C) __sfr RCON3;
__at(0x0F7C) volatile __RCON3bits_t RCON3bits;

__at(0x0F7D) __sfr RCON2;
__at(0x0F7D) volatile __RCON2bits_t RCON2bits;

__at(0x0F7E) __sfr EECON2;

__at(0x0F7F) __sfr EECON1;
__at(0x0F7F) volatile __EECON1bits_t EECON1bits;

__at(0x0F80) __sfr PORTA;
__at(0x0F80) volatile __PORTAbits_t PORTAbits;

__at(0x0F81) __sfr PORTB;
__at(0x0F81) volatile __PORTBbits_t PORTBbits;

__at(0x0F82) __sfr PORTC;
__at(0x0F82) volatile __PORTCbits_t PORTCbits;

__at(0x0F83) __sfr PORTD;
__at(0x0F83) volatile __PORTDbits_t PORTDbits;

__at(0x0F84) __sfr PORTE;
__at(0x0F84) volatile __PORTEbits_t PORTEbits;

__at(0x0F85) __sfr PORTF;
__at(0x0F85) volatile __PORTFbits_t PORTFbits;

__at(0x0F86) __sfr PORTG;
__at(0x0F86) volatile __PORTGbits_t PORTGbits;

__at(0x0F89) __sfr LATA;
__at(0x0F89) volatile __LATAbits_t LATAbits;

__at(0x0F8A) __sfr LATB;
__at(0x0F8A) volatile __LATBbits_t LATBbits;

__at(0x0F8B) __sfr LATC;
__at(0x0F8B) volatile __LATCbits_t LATCbits;

__at(0x0F8C) __sfr LATD;
__at(0x0F8C) volatile __LATDbits_t LATDbits;

__at(0x0F8D) __sfr LATE;
__at(0x0F8D) volatile __LATEbits_t LATEbits;

__at(0x0F8E) __sfr LATF;
__at(0x0F8E) volatile __LATFbits_t LATFbits;

__at(0x0F8F) __sfr LATG;
__at(0x0F8F) volatile __LATGbits_t LATGbits;

__at(0x0F92) __sfr TRISA;
__at(0x0F92) volatile __TRISAbits_t TRISAbits;

__at(0x0F93) __sfr TRISB;
__at(0x0F93) volatile __TRISBbits_t TRISBbits;

__at(0x0F94) __sfr TRISC;
__at(0x0F94) volatile __TRISCbits_t TRISCbits;

__at(0x0F95) __sfr TRISD;
__at(0x0F95) volatile __TRISDbits_t TRISDbits;

__at(0x0F96) __sfr TRISE;
__at(0x0F96) volatile __TRISEbits_t TRISEbits;

__at(0x0F97) __sfr TRISF;
__at(0x0F97) volatile __TRISFbits_t TRISFbits;

__at(0x0F98) __sfr TRISG;
__at(0x0F98) volatile __TRISGbits_t TRISGbits;

__at(0x0F9B) __sfr OSCTUNE;
__at(0x0F9B) volatile __OSCTUNEbits_t OSCTUNEbits;

__at(0x0F9C) __sfr PSTR1CON;
__at(0x0F9C) volatile __PSTR1CONbits_t PSTR1CONbits;

__at(0x0F9D) __sfr PIE1;
__at(0x0F9D) volatile __PIE1bits_t PIE1bits;

__at(0x0F9E) __sfr PIR1;
__at(0x0F9E) volatile __PIR1bits_t PIR1bits;

__at(0x0F9F) __sfr IPR1;
__at(0x0F9F) volatile __IPR1bits_t IPR1bits;

__at(0x0FA0) __sfr PIE2;
__at(0x0FA0) volatile __PIE2bits_t PIE2bits;

__at(0x0FA1) __sfr PIR2;
__at(0x0FA1) volatile __PIR2bits_t PIR2bits;

__at(0x0FA2) __sfr IPR2;
__at(0x0FA2) volatile __IPR2bits_t IPR2bits;

__at(0x0FA3) __sfr PIE3;
__at(0x0FA3) volatile __PIE3bits_t PIE3bits;

__at(0x0FA4) __sfr PIR3;
__at(0x0FA4) volatile __PIR3bits_t PIR3bits;

__at(0x0FA5) __sfr IPR3;
__at(0x0FA5) volatile __IPR3bits_t IPR3bits;

__at(0x0FA6) __sfr PIR6;
__at(0x0FA6) volatile __PIR6bits_t PIR6bits;

__at(0x0FA7) __sfr PSPCON;
__at(0x0FA7) volatile __PSPCONbits_t PSPCONbits;

__at(0x0FA8) __sfr HLVDCON;
__at(0x0FA8) volatile __HLVDCONbits_t HLVDCONbits;

__at(0x0FA9) __sfr IPR6;
__at(0x0FA9) volatile __IPR6bits_t IPR6bits;

__at(0x0FAA) __sfr T1GCON;
__at(0x0FAA) volatile __T1GCONbits_t T1GCONbits;

__at(0x0FAB) __sfr RCSTA;
__at(0x0FAB) volatile __RCSTAbits_t RCSTAbits;

__at(0x0FAB) __sfr RCSTA1;
__at(0x0FAB) volatile __RCSTA1bits_t RCSTA1bits;

__at(0x0FAC) __sfr TXSTA;
__at(0x0FAC) volatile __TXSTAbits_t TXSTAbits;

